**Name:** Jobair Islam 

**Studednt ID:** Omitted

In [1]:
## Importing necessary libraries

import numpy as np
import pandas as pd

### Answer to the Question No: 01

 full_group.csv

In [2]:
## Reading the given 'csv' file 

df = pd.read_csv('full_group.csv')
df.head(3)

,Date,CountryRegion,Confirmed,Deaths,Recovered,Active,New_cases,New_deaths,New_recovered,WHO_Region,year,month,day
0,2020-01-22,Afghanistan,0,0,0,0,0,0,0,Eastern Mediterranean,2020,1,22
1,2020-01-22,Albania,0,0,0,0,0,0,0,Europe,2020,1,22
2,2020-01-22,Algeria,0,0,0,0,0,0,0,Africa,2020,1,22

In [3]:
erl = df['Date'].min()     ## To fetch the Earliest date from the dataset

lat = df['Date'].max()     ## To fetch the latest date from the dataset

## printing the result

print("The Ealiest date is:", erl, '\n') 

print("And the Latest date is:", lat)

The Ealiest date is: 2020-01-22

And the Latest date is: 2020-07-27

In [4]:
## Choosing the month of April from the dataset

april = df[df.month == 4]
april.tail(3)

,Date,CountryRegion,Confirmed,Deaths,Recovered,Active,New_cases,New_deaths,New_recovered,WHO_Region,year,month,day
18697,2020-04-30,Yemen,6,2,1,3,0,2,0,Eastern Mediterranean,2020,4,30
18698,2020-04-30,Zambia,106,3,55,48,9,0,1,Africa,2020,4,30
18699,2020-04-30,Zimbabwe,40,4,5,31,8,0,0,Africa,2020,4,30

In [5]:
## To count the total death in April

death = april['New_deaths'].sum()  

## printing the result

print('The total deaths in the month of April is:', death)

The total deaths in the month of April is: 190226

In [6]:
## Creating new DataFrame with the two columns- 'CountryRegion' and 'WHO_Region'

new_df = pd.DataFrame(df, columns = ['CountryRegion', 'WHO_Region'])
new_df.head(3)

  CountryRegion             WHO_Region
0   Afghanistan  Eastern Mediterranean
1       Albania                 Europe
2       Algeria                 Africa

In [7]:
## To check duplicates

new_df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
35151     True
35152     True
35153     True
35154     True
35155     True
Length: 35156, dtype: bool

In [8]:
## To remove duplicates

no_dup = new_df.drop_duplicates()
no_dup.tail()

          CountryRegion             WHO_Region
182  West Bank and Gaza  Eastern Mediterranean
183      Western Sahara                 Africa
184               Yemen  Eastern Mediterranean
185              Zambia                 Africa
186            Zimbabwe                 Africa

In [9]:
## Counting the number of different CountryRegion appear in the dataset

num_CountryRegion = no_dup['CountryRegion'].count()

## Printing the result

print("The total CountryRegion appears in the dataset is:", num_CountryRegion)

The total CountryRegion appears in the dataset is: 187

In [10]:
## Checking the WHO_Region with the number of CountryRegions associated to it

number = no_dup['WHO_Region'].value_counts()
number

Europe                   56
Africa                   48
Americas                 35
Eastern Mediterranean    22
Western Pacific          16
South-East Asia          10
Name: WHO_Region, dtype: int64

In [11]:
## Finding the WHO_Region which has the most CountryRegion associated to it
number.max()

56

In [12]:
## Therefore, Europe has the most CoutryRegion associated to it.

In [13]:
## Selecting the months of 'March' and 'April', and the country- 'US' from the dataset

selection = df.loc[df.month.isin([3, 4]) & df.CountryRegion.isin(['US'])]
selection.head(3)

,Date,CountryRegion,Confirmed,Deaths,Recovered,Active,New_cases,New_deaths,New_recovered,WHO_Region,year,month,day
7466,2020-03-01,US,30,1,7,22,6,0,0,Americas,2020,3,1
7653,2020-03-02,US,53,6,7,40,23,5,0,Americas,2020,3,2
7840,2020-03-03,US,73,7,7,59,20,1,0,Americas,2020,3,3

In [14]:
## Calculating the average number of daily new deaths in March in the US

avg_daily_new_death_march = selection.loc[(selection['month'] == 3)]['New_deaths'].mean()
avg_daily_new_death_march

180.7741935483871

In [15]:
## Calculating the average number of daily new deaths in April in the US

avg_daily_new_death_april = selection.loc[(selection['month'] == 4)]['New_deaths'].mean()
avg_daily_new_death_april

1955.0333333333333

In [16]:
## Comparing daily new deaths in March and April in the US and printing the result

if avg_daily_new_death_march > avg_daily_new_death_april:
    
    print("The average number of daily new deaths was higher in March in US")
    
elif avg_daily_new_death_march < avg_daily_new_death_april:
    
    print("The average number of daily new deaths was higher in April in US")
else:
    print("The average number of daily new deaths was equal in March and April in US")

The average number of daily new deaths was higher in April in US

### Answer to the Question No: 02

AB_NYC_2019.csv

In [17]:
## Reading the given 'csv' file 

df_1 = pd.read_csv('AB_NYC_2019.csv')
df_1.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [18]:
## Grouping the data according to the 'neighbourhood_group'

nbr_group = df_1.groupby(['neighbourhood_group'])
nbr_group.first()

,id,name,host_id,host_name,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
neighbourhood_group,,,,,,,,,,,,,,,
Bronx,44096,Room with a View,190409,Waundell,Highbridge,40.83232,-73.93184,Private room,40,1,219,2019-07-04,2.04,3,353
Brooklyn,2539,Clean & quiet apt home by the park,2787,John,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
Manhattan,2595,Skylit Midtown Castle,2845,Jennifer,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
Queens,12937,"1 Stop fr. Manhattan! Private Suite,Landmark B...",50124,Orestes,Long Island City,40.74771,-73.94740,Private room,130,3,248,2019-07-01,2.25,1,215
Staten Island,42882,New York room with a view,185978,Newyorkroomwithaview,St. George,40.64524,-74.08088,Private room,70,2,166,2019-06-13,1.66,1,312

In [19]:
## Cross-checking the items in neighbourhood_group (optional)

for items, df_1 in nbr_group:
    print(items)

Bronx
Brooklyn
Manhattan
Queens
Staten Island

In [20]:
## Calculating the average price

avg_price = nbr_group['price'].mean()
avg_price

neighbourhood_group
Bronx             87.496792
Brooklyn         124.383207
Manhattan        196.875814
Queens            99.517649
Staten Island    114.812332
Name: price, dtype: float64

In [21]:
## Checking the highest average price

avg_price.max()

196.8758136743456

In [22]:
## (i) Therfore, the neighbourhood_group 'Queens' has the highest average price

In [23]:
## Calculating the total number of reviews

total_reviews = nbr_group['number_of_reviews'].sum()
total_reviews

neighbourhood_group
Bronx             28371
Brooklyn         486574
Manhattan        454569
Queens           156950
Staten Island     11541
Name: number_of_reviews, dtype: int64

In [24]:
## Checking the highest total number of reviews

total_reviews.max()

486574

In [70]:
##### Optional. I can use this to print the result

x = total_reviews.sort_values(ascending = False)[:][0:1]

neighbourhood_group
Brooklyn    486574
Name: number_of_reviews, dtype: int64

In [ ]:
print(total_reviews.sort_values(ascending = False)'')

In [25]:
## (ii) Therefore, the neighbourhood_group 'Brooklyn' has the highest total number of reviews.

In [26]:
## Grouping the data according to the 'room_type'

rtype_group = df_1.groupby(['room_type'])
rtype_group.first()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
room_type,,,,,,,,,,,,,,,
Entire home/apt,225976,Sunny cozy multileveled apartment!,1177947,Marina,Staten Island,Shore Acres,40.61077,-74.06824,75,6,76,2019-06-13,0.80,1,278
Private room,42882,New York room with a view,185978,Newyorkroomwithaview,Staten Island,St. George,40.64524,-74.08088,70,2,166,2019-06-13,1.66,1,312
Shared room,22977021,Spacious Room4 Rent Near Hospital in Staten Is...,46723570,Kartikeya,Staten Island,South Beach,40.58950,-74.09663,20,4,1,2018-02-02,0.06,1,0

In [27]:
## Cross-checking the types of the rooms (optional)

for r, df_1 in rtype_group:
    print(r)

Entire home/apt
Private room
Shared room

In [28]:
## Calculating average price and number of reviews 

avg_rtype_nd_reviews = rtype_group.agg({'price' : ['mean'], 'number_of_reviews' : ['mean']})
avg_rtype_nd_reviews

                      price number_of_reviews
                       mean              mean
room_type
Entire home/apt  173.846591         33.278409
Private room      62.292553         30.159574
Shared room       57.444444          1.555556

In [29]:
## Checking the highest average price and the highest average number of reviews

avg_rtype_nd_reviews.max()

price              mean    173.846591
number_of_reviews  mean     33.278409
dtype: float64

In [30]:
## Therefore, (i)'Entire home/apt' room type has the highest average price
## and (ii) 'Private room' room type has the highest average number of reviews.

## Answer to the Question No: 03
churn-bigml-80.csv

In [31]:
## Reading the given 'csv' file 

df_2 = pd.read_csv('churn-bigml-80.csv')
df_2.head()

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,Total eve calls,Total eve charge,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False
3,OH,84,408,Yes,No,0,299.4,71,50.90,61.9,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False
4,OK,75,415,Yes,No,0,166.7,113,28.34,148.3,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False

In [32]:
## Calculating total day calls, eve calls and night calls

call_sum = df_2[['Total day calls', 'Total eve calls', 'Total night calls']].sum()
call_sum

Total day calls      267427
Total eve calls      266663
Total night calls    266883
dtype: int64

In [33]:
## Checking the highest total number of calls

call_sum.max()

267427

In [34]:
## Therefore, 'Total day calls' has the higest number of calls.

In [35]:
## Calculating total day charge, eve charge and night charge

charge_sum = df_2[['Total day charge', 'Total eve charge', 'Total night charge']].sum()
charge_sum

Total day charge      81346.07
Total eve charge      45410.17
Total night charge    24134.47
dtype: float64

In [36]:
## Checking the highest total charge

charge_sum.max()

81346.07000000011

In [37]:
## As we can see,'Total day charge' is the highest here. 
## Therefore, the part of day with the highest total number of calls and with the highest total charge is the same.

In [38]:
## Calculating the maximum amount of customer service calls appered in the dataset and printing the result

print('The maximum amount of Customer Service calls in the dataset is:', df_2['Customer service calls'].max())

The maximum amount of Customer Service calls in the dataset is: 9

In [39]:
## Calculating the individuals who had 9 customer service calls

df_2['Customer service calls'].value_counts()

1    945
2    608
0    555
3    348
4    133
5     49
6     17
7      8
9      2
8      1
Name: Customer service calls, dtype: int64

In [40]:
## We can see, 02 individuals had 9 customer service calls

In [41]:
## Finding categorical columns in the dataset

df_2.select_dtypes(include=['category', object]).columns

Index(['State', 'International plan', 'Voice mail plan'], dtype='object')

In [42]:
## Checking  values of the categorical columns to find a cloumn with less than 5 possible values

df_2['International plan'].value_counts()

No     2396
Yes     270
Name: International plan, dtype: int64

In [53]:
#### Optional (another way of doing this and its the correct one)
## to check if the column has less than 5 possible values 

for col in df_2[['State', 'International plan', 'Voice mail plan']]:
    if len(df_2[col].unique()) < 5:
        print(col)

International plan
Voice mail plan

In [44]:
## As we see the in 'International plan' column, possible values are only 02- yes and no. 
## So, we can choose this column for our next task.

In [45]:
## Creating a dummy column on the basis of 'International plan' column

dum_col = pd.get_dummies(df_2['International plan'], prefix = 'Int. Plan')
dum_col.tail(3)

      Int. Plan_No  Int. Plan_Yes
2663             1              0
2664             1              0
2665             1              0

In [46]:
## Adding the dummy column to the dataset

df_2_dum = pd.concat([df_2, dum_col], axis = 1)

df_2_dum.head()

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,...,Total night minutes,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn,Int. Plan_No,Int. Plan_Yes
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,...,244.7,91,11.01,10.0,3,2.70,1,False,1,0
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,...,254.4,103,11.45,13.7,3,3.70,1,False,1,0
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,...,162.6,104,7.32,12.2,5,3.29,0,False,1,0
3,OH,84,408,Yes,No,0,299.4,71,50.90,61.9,...,196.9,89,8.86,6.6,7,1.78,2,False,0,1
4,OK,75,415,Yes,No,0,166.7,113,28.34,148.3,...,186.9,121,8.41,10.1,3,2.73,3,False,0,1

In [47]:
## Creating a new column as the sum of the total day, eve and night call columns

df_2_dum['Call_sum'] = df_2_dum['Total day calls'] + df_2_dum['Total night calls'] + df_2_dum['Total eve calls']
df_2_dum.head()

,State,Account length,Area code,International plan,Voice mail plan,Number vmail messages,Total day minutes,Total day calls,Total day charge,Total eve minutes,...,Total night calls,Total night charge,Total intl minutes,Total intl calls,Total intl charge,Customer service calls,Churn,Int. Plan_No,Int. Plan_Yes,Call_sum
0,KS,128,415,No,Yes,25,265.1,110,45.07,197.4,...,91,11.01,10.0,3,2.70,1,False,1,0,300
1,OH,107,415,No,Yes,26,161.6,123,27.47,195.5,...,103,11.45,13.7,3,3.70,1,False,1,0,329
2,NJ,137,415,No,No,0,243.4,114,41.38,121.2,...,104,7.32,12.2,5,3.29,0,False,1,0,328
3,OH,84,408,Yes,No,0,299.4,71,50.90,61.9,...,89,8.86,6.6,7,1.78,2,False,0,1,248
4,OK,75,415,Yes,No,0,166.7,113,28.34,148.3,...,121,8.41,10.1,3,2.73,3,False,0,1,356

In [48]:
## Calculating average number of calls

group = df_2_dum.groupby(['International plan'])['Call_sum']
group.mean()

International plan
No     300.281302
Yes    301.848148
Name: Call_sum, dtype: float64

In [49]:
## Finding who had in average higher number of calls

group.mean().max()

301.84814814814814

In [50]:
## Therefore, Customers with Internatinal Plan had average higher number of calls.